Repository: WordPressBugBounty/plugins-netsensai-shield
Catalog: netsensai-shield/languages/netsensai-shield-*.po
Languages: pl_pl

source: Settings
pl_pl: Ustawienia

source: Security Options
pl_pl: Opcje zabezpieczeń

source: Security Options:
pl_pl: Opcje zabezpieczeń:

source: Upgrade to NETSENSAI-SHIELD PRO for enhanced protection and advanced features.
pl_pl: Uaktualnij do NETSENSAI-SHIELD PRO, aby zyskać lepszą ochronę i zaawansowane funkcje.

source: Get yours now at:
pl_pl: Zdobądź swoją wersję już teraz na:

source: NETSENSAI Shield is a security plugin designed to enhance WordPress site protection by offering essential security features based on best practice principles.
pl_pl: NETSENSAI Shield to wtyczka zabezpieczająca, zaprojektowana w celu zwiększenia ochrony strony WordPress, oferująca najważniejsze funkcje bezpieczeństwa zgodnie z zasadą BEST PRACTICE.

source: Level 1: Basic Security
pl_pl: Poziom 1: Zabezpieczenia Podstawowe

source: Level 2: Intermediate Security
pl_pl: Poziom 2: Zabezpieczenia Średnie

source: Level 3: Advanced Security
pl_pl: Poziom 3: Zabezpieczenia Zaawansowane

source: Disable WP API JSON
pl_pl: Wyłącz WP API JSON

source: Disabling WP API JSON can protect your site from unauthorized access to sensitive data through the API. If left enabled, hackers may exploit WP API JSON to gather information about your site’s structure or perform enumeration attacks on users, which can lead to brute-force attacks.
pl_pl: Wyłączenie WP API JSON może zabezpieczyć Twoją stronę przed nieautoryzowanym dostępem do wrażliwych danych poprzez API. Jeśli pozostanie włączone, hakerzy mogą wykorzystać WP API JSON do zbierania informacji o strukturze Twojej strony lub przeprowadzenia ataków enumeracyjnych na użytkowników, co może prowadzić do ataków typu brute-force.

source: Disable XML-RPC
pl_pl: Wyłącz XML-RPC

source: Disabling XML-RPC blocks unauthorized remote access attempts, which can enhance security. If XML-RPC remains enabled, hackers might attempt to perform DDoS attacks by sending multiple requests or brute-force password attacks to gain control over your site.
pl_pl: Wyłączenie XML-RPC blokuje nieautoryzowane próby zdalnego dostępu, co może poprawić bezpieczeństwo. Jeśli XML-RPC pozostanie włączone, hakerzy mogą próbować przeprowadzać ataki DDoS, wysyłając liczne żądania, lub ataki brute-force w celu przejęcia kontroli nad Twoją stroną.

source: Disable File Editor
pl_pl: Wyłącz edytor plików

source: Disabling the file editor in the WP dashboard prevents unauthorized or accidental code changes. If left enabled, attackers who gain access to your admin panel could inject malicious code into your theme or plugin files, leading to a defacement of the site or the deployment of malware.
pl_pl: Wyłączenie edytora plików w panelu WP zabezpiecza przed nieautoryzowanymi lub przypadkowymi zmianami w kodzie. Jeśli pozostanie włączony, atakujący, którzy uzyskają dostęp do Twojego panelu administracyjnego, mogą wstrzyknąć złośliwy kod do plików motywu lub wtyczki, co może doprowadzić do oszpecenia strony lub wdrożenia złośliwego oprogramowania.

source: Disable WordPress Application Passwords
pl_pl: Wyłącz hasła aplikacji WordPress

source: Disabling application passwords secures against creating unauthorized accesses to your site’s API. If left enabled, hackers may exploit application passwords to gain persistent access to your site, enabling them to execute unauthorized API requests or even escalate their privileges.
pl_pl: Wyłączenie haseł aplikacji zabezpiecza przed tworzeniem nieautoryzowanego dostępu do API Twojej strony. Jeśli pozostaną włączone, hakerzy mogą wykorzystać hasła aplikacji, aby uzyskać trwały dostęp do Twojej strony, co umożliwi im wykonywanie nieautoryzowanych żądań do API lub nawet eskalację uprawnień.

source: Apply Security Headers
pl_pl: Zastosuj nagłówki bezpieczeństwa

source: Applying security headers can protect your site from XSS attacks and other threats. Without them, your site could be vulnerable to cross-site scripting (XSS) attacks or clickjacking, allowing attackers to steal sensitive data or trick users into executing malicious actions.
pl_pl: Zastosowanie nagłówków bezpieczeństwa może chronić Twoją stronę przed atakami typu XSS i innymi zagrożeniami. Bez nich Twoja strona może być podatna na ataki typu cross-site scripting (XSS) lub clickjacking, co umożliwi atakującym kradzież wrażliwych danych lub nakłonienie użytkowników do wykonania złośliwych działań.

source: Use ChatGPT for Unknown Headers
pl_pl: Użyj ChatGPT do nieznanych nagłówków

source: Enabling this option allows automatic analysis of less known headers using ChatGPT. If not enabled, potential security misconfigurations may remain undetected, leaving your site vulnerable to exploits such as header injection attacks or insufficient Content Security Policy (CSP) settings, which can lead to data breaches or XSS.
pl_pl: Włączenie tej opcji umożliwia automatyczną analizę mniej znanych nagłówków przy użyciu ChatGPT. Jeśli pozostanie wyłączona, potencjalne błędy w konfiguracji zabezpieczeń mogą pozostać niezauważone, co narazi Twoją stronę na ataki, takie jak ataki typu header injection lub niewystarczające ustawienia Content Security Policy (CSP), które mogą prowadzić do naruszenia danych lub ataków XSS.

source: Disable Directory Indexing
pl_pl: Wyłącz Indeksowanie Katalogów

source: Directory indexing allows attackers to list and access files in directories that lack an index file, exposing sensitive files and configurations. If directory indexing is not disabled, attackers can execute Directory Traversal attacks, gaining access to configuration files, logs, or even databases.
pl_pl: Indeksowanie katalogów pozwala atakującym na wyświetlanie i dostęp do plików w katalogach, które nie posiadają pliku indeksowego, co może prowadzić do ujawnienia wrażliwych plików i konfiguracji. Jeśli indeksowanie katalogów nie zostanie wyłączone, atakujący mogą przeprowadzić ataki typu Directory Traversal, uzyskując dostęp do plików konfiguracyjnych, logów, a nawet baz danych.

source: Change Login URL
pl_pl: Zmień URL logowania

source: Changing the login URL helps protect your site from brute-force attacks aimed at the default wp-login.php endpoint. If the default URL remains unchanged, attackers could easily target it to attempt password cracking or credential stuffing attacks.
pl_pl: Zmiana URL logowania pomaga chronić Twoją stronę przed atakami brute-force skierowanymi na domyślny punkt końcowy wp-login.php. Jeśli domyślny URL pozostanie niezmieniony, atakujący mogą łatwo go namierzyć, aby przeprowadzić ataki mające na celu złamanie haseł lub wykorzystanie wycieku danych do logowania.

source: Disable Default Admin
pl_pl: Wyłącz domyślny login Admina

source: The default "admin" username is a prime target for attackers attempting to breach your site. By changing this, you make it significantly harder for attackers to exploit common login details. If you leave the default admin username active, your site is vulnerable to Brute Force attacks, where attackers try thousands of password combinations against a known admin login.
pl_pl: Domyślna nazwa użytkownika „admin” jest głównym celem atakujących próbujących włamać się do Twojej witryny. Zmieniając ją, znacznie utrudniasz atakującym wykorzystanie powszechnych danych logowania. Jeśli pozostawisz domyślną nazwę użytkownika admin aktywną, Twoja witryna będzie podatna na ataki typu Brute Force, w których atakujący próbują tysięcy kombinacji haseł przeciwko znanemu loginowi administratora.

source: Enable HSTS
pl_pl: Włącz HSTS

source: HTTP Strict Transport Security (HSTS) enforces HTTPS, ensuring that all communication between the browser and the server is encrypted. This is critical for protecting sensitive user data and preventing man-in-the-middle attacks.
pl_pl: HTTP Strict Transport Security (HSTS) wymusza protokół HTTPS, zapewniając szyfrowaną komunikację między przeglądarką a serwerem. Jest to krytyczne dla ochrony poufnych danych użytkownika i zapobiegania atakom typu man-in-the-middle.

source: License Key
pl_pl: Klucz licencji

source: Disable Directory Indexing (PRO)
pl_pl: Wyłącz Indeksowanie Katalogów (PRO)

source: Enable HSTS (PRO)
pl_pl: Włącz HSTS (PRO)

source: Apply Security Headers (PRO)
pl_pl: Zastosuj nagłówki bezpieczeństwa (PRO)

source: Use ChatGPT for Unknown Headers (PRO)
pl_pl: Użyj ChatGPT do nieznanych nagłówków (PRO)

source: Save changes
pl_pl: Zapisz zmiany
